Start by looking at the data in exel

create a new database, give it a name, check the elements, 

- we want toimporta the data
- select table then import data

Why Use Jupyter notebook with MySQl

-Help document queries and result 
-In case of any errors, we can always go back and edit our query  unlike in MySQL workbench
-In a work setting where we run a lot of queries, these notebooks can help avoid repeated analysis.

How to use jupyter notebook with MySQl workbench 
- You'll need Anaconda (its free)
- Create your own environment 
- Then you will need to use a Python library for Mysql,such as 'pymysql' or 'mysql-connector' within the envrionment you created.

- I might need to create a whole walk through on the set up process. Probably in the future. 

For now lets see how it work we can use it to document our analysis.

# Pizza Sales Performance 

### Exploratory Data Analysis Questions

1. Total Revenue of Pizzas
2. Total Orders Placed
3. Average Amount Spent per Order (Total Revenue/Total Orders)
4. Total Pizza Sold
5. Average Pizza per Order (Number of Pizzas Sold/Total Order)

6. Daily Trend for Total Orders - Bar Chart
7. Hourly Trend for Total Orders -Line Chart
9. Monthly Trend for Total order - Line Chart
8. Percent of Sales by Pizza Category - Pie Chart

6. Percentage Sales by Pizza Size - Pie Chart
7. Total Pizza Sold by Pizza Category -Funnel Chart
8. Top 5 Best Sellers by Revenue, Total Quantity, Total Orders  - Bar Chart
9. Bottom 5 Best Sellers by Revenue, Total Quantity, Total Orders  - Bar Chart

In [7]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name.

%sql mysql+pymysql://root:password@localhost:3306/sales

'Connected: root@sales'

## Understanding the Data

In [9]:
%%sql 

SELECT * FROM sales.pizza_sales 
limit 10;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[(1, 1, 'hawaiian_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=41916), 13.25, 13.25, 'M', 'Classic', 'Sliced Ham, Pineapple, Mozzarella Cheese', 'The Hawaiian Pizza'),
 (2, 2, 'classic_dlx_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43060), 16.0, 16.0, 'M', 'Classic', 'Pepperoni, Mushrooms, Red Onions, Red Peppers, Bacon', 'The Classic Deluxe Pizza'),
 (3, 2, 'five_cheese_l', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43060), 18.5, 18.5, 'L', 'Veggie', 'Mozzarella Cheese, Provolone Cheese, Smoked Gouda Cheese, Romano Cheese, Blue Cheese, Garlic', 'The Five Cheese Pizza'),
 (4, 2, 'ital_supr_l', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43060), 20.75, 20.75, 'L', 'Supreme', 'Calabrese Salami, Capocollo, Tomatoes, Red Onions, Green Olives, Garlic', 'The Italian Supreme Pizza'),
 (5, 2, 'mexicana_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43060), 16.0, 16.0, 'M', 'Veggie', 'Tomatoes, Red Peppers, Jalapeno Peppers, Red Onions, Cilantro, Corn, Chipotle Sauce, Garlic', 'The Mexicana Pizza'),
 (6, 2, 'thai_ckn_l', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43060), 20.75, 20.75, 'L', 'Chicken', 'Chicken, Pineapple, Tomatoes, Red Peppers, Thai Sweet Chilli Sauce', 'The Thai Chicken Pizza'),
 (7, 3, 'ital_supr_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43948), 16.5, 16.5, 'M', 'Supreme', 'Calabrese Salami, Capocollo, Tomatoes, Red Onions, Green Olives, Garlic', 'The Italian Supreme Pizza'),
 (8, 3, 'prsc_argla_l', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=43948), 20.75, 20.75, 'L', 'Supreme', 'Prosciutto di San Daniele, Arugula, Mozzarella Cheese', 'The Prosciutto and Arugula Pizza'),
 (9, 4, 'ital_supr_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=44191), 16.5, 16.5, 'M', 'Supreme', 'Calabrese Salami, Capocollo, Tomatoes, Red Onions, Green Olives, Garlic', 'The Italian Supreme Pizza'),
 (10, 5, 'ital_supr_m', 1, datetime.date(2015, 1, 1), datetime.timedelta(seconds=44490), 16.5, 16.5, 'M', 'Supreme', 'Calabrese Salami, Capocollo, Tomatoes, Red Onions, Green Olives, Garlic', 'The Italian Supreme Pizza')]

### 1. Total PIzzas Revenue

In [10]:
%%sql

SELECT 
    SUM(total_price) AS Total_Revenue
FROM
    pizza_sales;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(817860.0508384705,)]

### 2. Total Orders Placed

In [11]:
%%sql

SELECT 
    COUNT(DISTINCT order_id)
FROM
    pizza_sales;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(21350,)]

 ### 3. Average Amount Spent Per Order (total revenue/total orders)

In [13]:
%%sql

SELECT 
    SUM(total_price) / COUNT(DISTINCT order_id) AS Average_Amount_Per_Order
FROM
    pizza_sales;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(38.30726233435459,)]

### 4. Total pizza sold

In [14]:
%%sql

SELECT 
    SUM(quantity)
FROM
    pizza_sales;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('49574'),)]

### 5. Average Pizza Per Order (number of pizzas sold/total order) 
-#$Calculation then cast. Number of orders should be a whole number

In [33]:
%%sql
SELECT 
    CAST(SUM(quantity) / COUNT(DISTINCT order_id) AS DECIMAL (10 , 2 )) AS Avg_Pizzas_per_order
FROM
    pizza_sales;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('2.32'),)]

### 6. Daily Trend for Total Orders

In [37]:
%%sql

SELECT 
    COUNT(DISTINCT order_id) AS Total_order,
    DAYNAME(order_date) AS day_of_week
FROM
    pizza_sales
GROUP BY DAYNAME(order_date);

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
7 rows affected.

[(3538, 'Friday'),
 (2794, 'Monday'),
 (3158, 'Saturday'),
 (2624, 'Sunday'),
 (3239, 'Thursday'),
 (2973, 'Tuesday'),
 (3024, 'Wednesday')]

### 7. Hourly Trend for Total Orders

In [39]:
%%sql

SELECT 
    COUNT(DISTINCT order_id) AS Total_order,
    HOUR(order_time) AS hour_of_the_day
FROM
    pizza_sales
GROUP BY HOUR(order_time);

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
15 rows affected.

[(1, 9),
 (8, 10),
 (1231, 11),
 (2520, 12),
 (2455, 13),
 (1472, 14),
 (1468, 15),
 (1920, 16),
 (2336, 17),
 (2399, 18),
 (2009, 19),
 (1642, 20),
 (1198, 21),
 (663, 22),
 (28, 23)]

### 8. Monthly Trend for Total Order

In [42]:
%%sql

SELECT 
    COUNT(DISTINCT order_id) AS Total_order,
    MONTHNAME(order_date) AS MONTH
FROM
    pizza_sales
GROUP BY MONTHNAME(order_date);

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
12 rows affected.

[(1799, 'April'),
 (1841, 'August'),
 (1680, 'December'),
 (1685, 'February'),
 (1845, 'January'),
 (1935, 'July'),
 (1773, 'June'),
 (1840, 'March'),
 (1853, 'May'),
 (1792, 'November'),
 (1646, 'October'),
 (1661, 'September')]

### 9. Percent of Sales by Pizza Category

In [44]:
%%sql
SELECT 
pizza_category, 
Cast(sum(total_price)*100 /(select sum(total_price) from pizza_sales) As decimal(10,2)) As Percentage
FROM pizza_sales

group by pizza_category;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
4 rows affected.

[('Classic', Decimal('26.91')),
 ('Veggie', Decimal('23.68')),
 ('Supreme', Decimal('25.46')),
 ('Chicken', Decimal('23.96'))]

### 10. Percentage Sales by Pizza Size

In [45]:
%%sql
SELECT 
    pizza_size,
    CAST(SUM(total_price) * 100 / (SELECT 
                SUM(total_price)
            FROM
                pizza_sales)
        AS DECIMAL (10 , 2 )) AS Percentage
FROM
    pizza_sales
GROUP BY pizza_size;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('M', Decimal('30.49')),
 ('L', Decimal('45.89')),
 ('S', Decimal('21.77')),
 ('XL', Decimal('1.72')),
 ('XXL', Decimal('0.12'))]

### 11. Total Pizza Sold by Pizza Category

In [47]:
%%sql

SELECT 
    pizza_category, SUM(quantity) As Total_pizza_sold
FROM
    sales.pizza_sales
GROUP BY pizza_category;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
4 rows affected.

[('Classic', Decimal('14888')),
 ('Veggie', Decimal('11649')),
 ('Supreme', Decimal('11987')),
 ('Chicken', Decimal('11050'))]

### 12.Top 5 Best Sellers by revenue

In [56]:
%%sql

SELECT * FROM sales.pizza_sales;

SELECT 
    pizza_name, SUM(total_price) As Total_Revenue
FROM
    pizza_sales
GROUP BY pizza_name
order by total_revenue DESC
Limit 5;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
48620 rows affected.
5 rows affected.

[('The Thai Chicken Pizza', 43434.25),
 ('The Barbecue Chicken Pizza', 42768.0),
 ('The California Chicken Pizza', 41409.5),
 ('The Classic Deluxe Pizza', 38180.5),
 ('The Spicy Italian Pizza', 34831.25)]

### 13 Bottom 5 Best Sellers by Revenue

In [57]:
%%sql

SELECT 
    pizza_name, SUM(total_price) As Total_Revenue
FROM
    pizza_sales
GROUP BY pizza_name
order by total_revenue ASC
Limit 5;

 * mysql+pymysql://root:***@localhost:3306/sales
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('The Brie Carre Pizza', 11588.499813079834),
 ('The Green Garden Pizza', 13955.75),
 ('The Spinach Supreme Pizza', 15277.75),
 ('The Mediterranean Pizza', 15360.5),
 ('The Spinach Pesto Pizza', 15596.0)]